OpenFOAM-dev/tutorials/multicomponentFluid/filter/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    cycLeft
    {
        type        faceZone;
        zoneName    cycLeft;

        owner
        {
            name        cycLeft_half0;
            type        cyclic;
            neighbourPatch cycLeft_half1;
        }

        neighbour
        {
            name        cycLeft_half1;
            type        cyclic;
            neighbourPatch cycLeft_half0;
        }
    }

    cycRight
    {
        type        faceZone;
        zoneName    cycRight;

        owner
        {
            name        cycRight_half0;
            type        cyclic;
            neighbourPatch cycRight_half1;
        }

        neighbour
        {
            name        cycRight_half1;
            type        cyclic;
            neighbourPatch cycRight_half0;
        }
    }
}


// ************************************************************************* //
